#############################################################################
### Търсене и извличане на информация. Приложение на дълбоко машинно обучение
### Стоян Михов
### Зимен семестър 2020/2021
#############################################################################

### Домашно задание 1
###
### За да работи програмата трябва да се свали корпус от публицистични текстове за Югоизточна Европа,
### предоставен за некомерсиално ползване от Института за български език - БАН
###
### Корпусът може да бъде свален от:
### Отидете на http://dcl.bas.bg/BulNC-registration/#feeds/page/2
### И Изберете:
###
### Корпус с новини
### Корпус от публицистични текстове за Югоизточна Европа.
### 27.07.2012 Български
###    35337  7.9M
###
### http://dcl.bas.bg/BulNC-registration/dl.php?dl=feeds/JOURNALISM.BG.zip
###
### Архивът трябва да се разархивира в директорията, в която е програмата.
###
### Преди да се стартира програмата е необходимо да се активира съответното обкръжение с командата:
### conda activate tii
###
### Ако все още нямате създадено обкръжение прочетете файла README.txt за инструкции

import model
import numpy as np

def editDistance(s1, s2):
    #### функцията намира разстоянието на Левенщайн-Дамерау между два низа
    #### вход: низовете s1 и s2
    #### изход: минималният брой на елементарните операции ( вмъкване, изтриване, субституция и транспоциция на символи) необходими, за да се получи от единия низ другия

    #############################################################################
    #### Начало на Вашия код. На мястото на pass се очакват 10-25 реда

    M = np.zeros((len(s1)+1,len(s2)+1))
    for i in range(len(s1) + 1):
        M[i,0] = i
    for j in range(len(s2) + 1):
        M[0,j] = j
    for i in range(1, len(s1) + 1):
        for j in range(1, len(s2) + 1):
            if s1[i-1] == s2[j-1]:
                M[i,j] = M[i-1,j-1]
            elif i >= 2 and j >= 2 and s1[i-1] == s2[j-2] and s1[i-2] == s2[j-1]:
                M[i,j] = 1 + min(M[i-1,j-1], M[i-1,j], M[i,j-1], M[i-2,j-2])
            else:
                M[i,j] = 1 + min(M[i-1,j-1], M[i-1,j], M[i,j-1])
    return M[len(s1),len(s2)]

    #### Край на Вашия код
    #############################################################################


def operationWeight(a,b):
    #### Функцията primitiveWeight връща теглото на дадена елементарна операция
    #### Тук сме реализирали функцията съвсем просто -- връщат се фиксирани тегла, които не зависят от конкретните символи. При наличие на статистика за честотата на грешките тези тегла следва да се заменят със съответни тегла получени след оценка на вероятността за съответната грешка, използвайки принципа за максимално правдоподобие
    #### Вход: Двата низа a,b, определящи операцията.
    #### Важно! При изтриване и вмъкване се предполага, че празния низ е представен с None
    #### изход: Теглото за операцията

    if a == None and len(b) == 1:
        return 3.0          # insertion
    elif b == None and len(a) == 1:
        return 3.0          # deletion
    elif a == b and len(a) == 1:
        return 0.0          # identity
    elif len(a) == 1 and len(b) == 1:
        return 2.5          # substitution
    elif len(a) == 2 and len(b)==2 and a[0] == b[1] and a[1] == b[0]:
        return 2.25         # transposition
    else:
        print("Wrong parameters ({},{}) of primitiveWeight call encountered!".format(a,b))

def editWeight(s1, s2):
    #### функцията editWeight намира теглото между два низа
    #### За намиране на елеметарните тегла следва да се извиква функцията operationWeight
    #### вход: низовете s1 и s2
    #### изход: минималното тегло за подравняване, за да се получи от единия низ другия
    
    #############################################################################
    #### Начало на Вашия код. На мястото на pass се очакват 10-25 реда

    M = np.zeros((len(s1)+1,len(s2)+1))
    M[0,0] = 0
    for i in range(1,len(s1) + 1):
        M[i,0] = M[i-1,0] + operationWeight(s1[i-1], None)
    for j in range(1,len(s2) + 1):
        M[0,j] = M[0,j-1] + operationWeight(None, s2[j-1])
    for i in range(1,len(s1)+1):
        for j in range(1,len(s2)+1):
            if i >= 2 and j >= 2 and s1[i-1] == s2[j-2] and s1[i-2] == s2[j-1]:
                M[i,j] = min(
                             M[i-1,j-1] + operationWeight(s1[i-1],s2[j-1]),
                             M[i-1,j] + operationWeight(s1[i-1],None),
                             M[i,j-1] + operationWeight(None,s2[j-1]),
                             M[i-2,j-2] + operationWeight(s1[i-2:i],s2[j-2:j]))
            else:
                M[i,j] = min(
                             M[i-1,j-1] + operationWeight(s1[i-1],s2[j-1]),
                             M[i-1,j] + operationWeight(s1[i-1],None),
                             M[i,j-1] + operationWeight(None,s2[j-1]))
    return M[len(s1),len(s2)]

    #### Край на Вашия код
    #############################################################################


def generateEdits(q):
    ### помощната функция, generate_edits по зададена заявка генерира всички възможни редакции на разстояние едно от тази заявка.
    ### Вход: заявка като низ q
    ### Изход: Списък от низове на разстояние 1 по Левенщайн-Дамерау от заявката
    ###
    ### В тази функция вероятно ще трябва да използвате азбука, която е дефинирана в model.alphabet
    ###
    #############################################################################
    #### Начало на Вашия код. На мястото на pass се очакват 10-15 реда

    L = []
    for i in range(len(q)):
        L.append(q[:i]+q[i+1:]) #deletion
        for c in model.alphabet:
            L.append(q[:i]+c+q[i:]) # insertion
            if c != q[i]: L.append(q[:i]+c+q[i+1:]) # substitution
            if i>0:
                L.append(q[:i-1]+q[i]+q[i-1]+q[i+1:]) # transposition
        for c in model.alphabet:
            L.append(q+c) # insertion after last symbol
    return L

    #### Край на Вашия код
    #############################################################################




def generateCandidates(query,dictionary):
    ### Започва от заявката query и генерира всички низове НА РАЗСТОЯНИЕ <= 2, за да се получат кандидатите за корекция. Връщат се единствено кандидати, за които всички думи са в речника dictionary.
        
    ### Вход:
    ###     Входен низ query
    ###     Речник: dictionary

    ### Изход:
    ###     Списък от двойки (candidate, candidate_edit_log_probability), където candidate е низ на кандидат, а candidate_edit_log_probability е логаритъм от вероятността за редакция -- минус теглото.
    
    def allWordsInDictionary(q):
        ### Помощна функция, която връща истина, ако всички думи в заявката са в речника
        return all(w in dictionary for w in q.split())


    #############################################################################
    #### Начало на Вашия код. На мястото на pass се очакват 10-15 реда

    L=[]
    if allWordsInDictionary(query):
        L.append((query,0))
    for query1 in generateEdits(query):
        if allWordsInDictionary(query1):
            L.append((query1,-editWeight(query1,query)))
        for query2 in generateEdits(query1):
            if allWordsInDictionary(query2):
                L.append((query2,-editWeight(query2,query)))
    return L

    #### Край на Вашия код
    #############################################################################


def correctSpelling(r, model, mu = 1.0, alpha = 0.9):
    ### Комбинира езиковия модел model с кандидатите за корекция генерирани от generate_candidates за създаване на най-вероятната желана заявка за дадената оригинална заявка query.            Генераторът на кандидати връща и вероятността за редактиране.
    ###
    ### Вход:
    ###    заявка: r,
    ###    езиков модел: model,
    ###    тегло на езиковия модел: mu
    ###    коефициент за интерполация на езиковият модел: alpha
    ### Изход: най-вероятната заявка

    def getScore(q,logEditProb):
    
        ### Използва езиковия модел и вероятността за редакцията "log_edit_prob" за изчисляване на оценка за кандидатска "q". Използва `mu` като степен на тежест за Pr[q].
    
        ### вход:
        ### q (str): Заявка за кандидат.
        ### log_edit_prob (float): Логаритъм от вероятност за редакция на дадената заявка (т.е. log Pr[r|q], където r е оригиналната заявка).
        ### изход:
        ### log_p (float): Краен резултат за заявката, т.е. логаритъм от вероятността за кандидат заявката.
        #############################################################################
        #### Начало на Вашия код. На мястото на pass се очакват 1-3 реда

#### ВНИМАНИЕ! Правилният начин за извикване на метода sentenceLogProbability изисква низа да се предхожда от model.startToken
#### Т.е. би следвало да се извика:
####    return logEditProb + mu * model.sentenceLogProbability([model.startToken] + q.split(),alpha)
#### Но тъй като никой не го е направил правилно като подарък за 8-ми декември съм приел неправилното извикване

        return logEditProb + mu * model.sentenceLogProbability(q.split(),alpha)

        #### Край на Вашия код
        #############################################################################

    ###
    ###
    #############################################################################
    #### Начало на Вашия код за основното тяло на функцията correct_spelling. На мястото на pass се очакват 2-5 реда

    query,_ = max(((q,getScore(q,lep)) for q,lep in generateCandidates(r,model.kgrams[tuple()])), key= lambda x: x[1])
    return query

    #### Край на Вашия код
    #############################################################################


